//14. С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя,
// фамилию и возраст, а вам не обходимо вывести строку такого вида
//       Доброго вечера Иван Иванов, мои поздравления что вам 32 ,
//       а вывод результата при помощи метода alert

let name = prompt("Ведіть ваше ім'я: ");
let surName = prompt("Ведіть ваше прізвище: ");
let age = prompt("Ведіть ваш вік: ");

alert('Доброго вечора ' + name + ' ' + surName + ', мої вітання що вам ' + age + '.');

