//2.
// Все параматры получаем с клавиатуры!!!!
// Имитируем поведение пешехода на перекстке.
// Если светофор зеленый - вывести "иди".
// Если светофор желтый - вывести "подожди".
// Если светофор красный - вывести "стой".
// Если светофор в аварийном режиме вывести "делай что хочешь"!

let color = prompt('Якого кольору світлофор? \na: Зелений?\nb: Жовтий?\nc: Червоний?\nd: Аварійний?');

if(color === 'a' || color === 'Зелений' ){
    alert('Світлофор зелений: Можна йти!');
}
if(color === 'b' || color === 'Жовтий' ){
    alert('Світлофор жовтий: Потрібно зачекати!');
}
if(color === 'с' || color === 'Червоний' ){
    alert('Світлофор червоний: Стій!');
}
if(color === 'd' || color === 'Аварійний' ){
    alert('Світлофор аварійний: Роби що хочеш!');
}